Tutoriels/overInterDyMFoam/digueMonaco/background/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

Allmesh -c

# Add the cylinder mesh
runApplication mergeMeshes . ../floatingBody -overwrite

Allrun -prts &
#------------------------------------------------------------------------------
