Tutoriels/overInterDyMFoam/digueMonaco/background/constant/waveProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

inlet
{

    alpha            alpha.water;

    waveModel        irregularMultiDirectional;

    nPaddle          10;

    rampTime         2.0;

    activeAbsorption no;

    wavePeriods
    200
    (
(16.0)
(15.897289586305279)
(15.795889440113395)
(15.695774647887323)
(15.596920923722882)
(15.499304589707927)
(15.402902557014514)
(15.307692307692308)
(15.213651877133104)
(15.120759837177747)
(15.028995279838165)
(14.93833780160858)
(14.848767488341107)
(14.760264900662252)
(14.672811059907833)
(14.586387434554974)
(14.500975927130774)
(14.416558861578267)
(14.333118971061094)
(14.250639386189258)
(14.169103623649077)
(14.08849557522124)
(14.00879949717159)
(13.930000000000001)
(13.85208203853325)
(13.775030902348577)
(13.698832206515059)
(13.623471882640587)
(13.548936170212766)
(13.47521160822249)
(13.40228502705953)
(13.330143540669857)
(13.258774538964902)
(13.188165680473373)
(13.118304885226605)
(13.049180327868854)
(12.980780430984275)
(12.913093858632676)
(12.846109510086455)
(12.77981651376147)
(12.714204221334853)
(12.649262202043133)
(12.58498023715415)
(12.521348314606742)
(12.458356623812186)
(12.395995550611792)
(12.33425567238517)
(12.273127753303966)
(12.212602739726028)
(12.15267175572519)
(12.093326098752033)
(12.034557235421167)
(11.976356797420742)
(11.918716577540106)
(11.861628525811602)
(11.805084745762713)
(11.749077490774908)
(11.693599160545647)
(11.63864229765013)
(11.584199584199586)
(11.53026383859286)
(11.476828012358393)
(11.423885187083547)
(11.371428571428572)
(11.319451498222449)
(11.267947421638018)
(11.216909914443885)
(11.166332665330662)
(11.116209476309228)
(11.066534260178749)
(11.017301038062286)
(10.968503937007874)
(10.920137187653111)
(10.87219512195122)
(10.824672170956775)
(10.777562862669246)
(10.730861819932596)
(10.684563758389263)
(10.638663484486875)
(10.593155893536123)
(10.548035967818267)
(10.503298774740813)
(10.458939465039887)
(10.414953271028038)
(10.371335504885993)
(10.328081556997219)
(10.285186894323951)
(10.24264705882353)
(10.20045766590389)
(10.158614402917047)
(10.117113027689516)
(10.075949367088606)
(10.035119315623595)
(9.994618834080716)
(9.954443948191157)
(9.91459074733096)
(9.875055383252105)
(9.835834068843779)
(9.796923076923077)
(9.75831873905429)
(9.720017444395987)
(9.682015638575153)
(9.644309822587624)
(9.60689655172414)
(9.569772434521253)
(9.532934131736527)
(9.496378355347252)
(9.460101867572156)
(9.424101479915434)
(9.38837405223252)
(9.352916491817037)
(9.31772575250836)
(9.282798833819243)
(9.248132780082987)
(9.213724679619679)
(9.179571663920923)
(9.145670906852688)
(9.112019623875716)
(9.078615071283096)
(9.045454545454547)
(9.012535382126972)
(8.979854955680903)
(8.947410678442392)
(8.9152)
(8.883220406536468)
(8.851469420174743)
(8.81994459833795)
(8.788643533123029)
(8.757563850687623)
(8.726703210649962)
(8.696059305501366)
(8.665629860031103)
(8.635412630763271)
(8.605405405405405)
(8.57560600230858)
(8.54601226993865)
(8.516622086358426)
(8.487433358720487)
(8.458444022770399)
(8.429652042360061)
(8.401055408970977)
(8.372652141247183)
(8.344440284537626)
(8.316417910447761)
(8.288583116400149)
(8.260934025203856)
(8.233468784632434)
(8.206185567010309)
(8.17908256880734)
(8.152158010241404)
(8.125410134888808)
(8.098837209302326)
(8.072437522636726)
(8.046209386281587)
(8.02015113350126)
(7.994261119081779)
(7.968537718984628)
(7.942979330007128)
(7.917584369449378)
(7.8923512747875355)
(7.867278503353336)
(7.842364532019705)
(7.817607856892319)
(7.793006993006993)
(7.768560474032764)
(7.744266851980543)
(7.720124696917215)
(7.696132596685084)
(7.672289156626506)
(7.648592999313658)
(7.625042764283271)
(7.601637107776262)
(7.578374702482149)
(7.555254237288136)
(7.532274417032782)
(7.509433962264151)
(7.486731609002352)
(7.464166108506363)
(7.441736227045076)
(7.4194407456724365)
(7.397278460006638)
(7.375248180013236)
(7.353348729792148)
(7.331578947368421)
(7.309937684486718)
(7.288423806409418)
(7.267036191718291)
(7.245773732119637)
(7.224635332252836)
(7.2036199095022635)
(7.182726393812439)
(7.161953727506427)
(7.141300865107338)
(7.12076677316294)
(7.100350430073272)
(7.080050825921219)
(7.059866962305987)
(7.039797852179406)
(7.01984251968504)
(7.0)
    );

    waveHeights
    200
    (
(0.11344780310819158)
(0.11986896922609243)
(0.12638261996235778)
(0.13297633892005828)
(0.13963775084866722)
(0.14635460205768414)
(0.15311483883206464)
(0.15990668418184828)
(0.16671871338235253)
(0.17353992886886774)
(0.1803598351371505)
(0.18716851436400606)
(0.19395670349644484)
(0.20071587355870954)
(0.20743831188939216)
(0.214117207941707)
(0.22074674315525822)
(0.22732218523482978)
(0.23383998694982253)
(0.24029788929767612)
(0.24669502855882017)
(0.25303204641457844)
(0.2593112019104897)
(0.2655364836354392)
(0.2717137200632284)
(0.2778506855802291)
(0.2839571993131582)
(0.29004521348621554)
(0.2961288876859075)
(0.30222464510020036)
(0.3083512065266146)
(0.31452959770636424)
(0.32078312532756303)
(0.3271373168336468)
(0.33361981895350074)
(0.3402602496164342)
(0.34708999761004633)
(0.35414196397195014)
(0.3614502386808784)
(0.3690497057528804)
(0.3769755694055661)
(0.3852627936130195)
(0.39394544726110037)
(0.4030559473954232)
(0.41262419394391214)
(0.4226765910430076)
(0.4332349529801507)
(0.44431529707312534)
(0.45592653180740356)
(0.46806905645417046)
(0.48073329829093897)
(0.49389822536742634)
(0.5075298861853849)
(0.5215800420709419)
(0.5359849724332699)
(0.5506645461655861)
(0.5655216624378762)
(0.5804421690694087)
(0.5952953644606283)
(0.6099351777550938)
(0.6242020999945307)
(0.6379259058376483)
(0.6509291614096333)
(0.6630314609364663)
(0.6740542764442928)
(0.6838262458556383)
(0.6921886712463086)
(0.6990009572292489)
(0.7041456953924521)
(0.7075330990994144)
(0.7091045162462707)
(0.7089753670671195)
(0.7076396043941017)
(0.7051586050102117)
(0.7015642775677474)
(0.6969004106999181)
(0.6912216783008921)
(0.6845924150368966)
(0.6770852088246718)
(0.6687793621064165)
(0.6597592760494005)
(0.6501128113465003)
(0.6399296763196134)
(0.6292998879119984)
(0.618312344386622)
(0.607053540673206)
(0.5956064488841788)
(0.5840495780733265)
(0.5724562192967297)
(0.5608938748179413)
(0.549423864138765)
(0.53810109458817)
(0.5269739805209801)
(0.516084492736531)
(0.5054683184298817)
(0.49515511169112897)
(0.48516881510014226)
(0.47552803414091804)
(0.46624644780087005)
(0.45733324065782854)
(0.4487935438441001)
(0.4406288743900576)
(0.4328375644929138)
(0.4254151741587308)
(0.41835488237967533)
(0.4116478535069615)
(0.4052835767522365)
(0.3992501777991719)
(0.3935347023450377)
(0.3881233720380746)
(0.3830018137534619)
(0.37815526348333056)
(0.37356874632941445)
(0.3692272342042849)
(0.36511578289041796)
(0.3612196500947905)
(0.35752439608681646)
(0.35401596843276023)
(0.35068077225127486)
(0.34750572732065704)
(0.34447831327490275)
(0.34158660403672847)
(0.338819292553836)
(0.3361657068309487)
(0.33361581818462377)
(0.3311602425899294)
(0.32879023593663687)
(0.32649768396629625)
(0.324275087618958)
(0.3221155444780349)
(0.3200127269626277)
(0.3179608578775982)
(0.31595468389203324)
(0.3139894474760654)
(0.31206085778411363)
(0.3101650609295225)
(0.3082986100515827)
(0.30645843553136615)
(0.3046418156682532)
(0.3028463480849839)
(0.3010699220861403)
(0.2993106921536959)
(0.2975670527241728)
(0.29583761435545863)
(0.29412118135780346)
(0.2924167309332104)
(0.2907233938404963)
(0.28904043657982575)
(0.28736724507046957)
(0.28570330977884534)
(0.2840482122403824)
(0.28240161290822924)
(0.2807632402540319)
(0.27913288104069195)
(0.27751037168387394)
(0.27589559061778124)
(0.2742884515810823)
(0.27268889774054383)
(0.2710968965726919)
(0.2695124354273942)
(0.2679355177014642)
(0.2663661595550013)
(0.2648043871080658)
(0.2632502340602783)
(0.2617037396809306)
(0.2601649471220956)
(0.2586339020119478)
(0.2571106512900166)
(0.25559524225032043)
(0.2540877217622811)
(0.2525881356429435)
(0.2510965281573494)
(0.2496129416269214)
(0.2481374161284202)
(0.24666998926845138)
(0.24521069602064816)
(0.24375956861454087)
(0.24231663646678397)
(0.2408819261468559)
(0.23945546137059273)
(0.23803726301600237)
(0.23662734915672276)
(0.23522573510928285)
(0.23383243349099161)
(0.23244745428584618)
(0.23107080491632956)
(0.22970249031936277)
(0.22834251302501307)
(0.22699087323683143)
(0.22564756891292487)
(0.22431259584705165)
(0.22298594774918665)
(0.22166761632512244)
(0.22035759135478067)
(0.21905586076898373)
(0.21776241072450656)
(0.21647722567728034)
(0.21520028845365963)
(0.21393158031970172)
(0.21267108104842802)
    );

    wavePhases
    200
    (
(5.609182172228258)
(5.466377329205814)
(4.169212779508841)
(3.543039908601875)
(3.085317884395265)
(3.9458270516236467)
(4.886887644649557)
(1.8785422141445876)
(1.5287258291564352)
(2.6439951581413434)
(4.41268768592721)
(1.5542130603271873)
(2.991120980661842)
(4.998456851174474)
(3.261798770632138)
(5.658343401555057)
(2.0728296564423663)
(3.9174144727178484)
(0.0037838182936451832)
(1.6049282474235436)
(1.6652409001624249)
(1.5645157267578536)
(4.79873594527196)
(2.759092376499217)
(3.09625731028705)
(1.6418035676770697)
(4.866516258030835)
(2.67687795628319)
(6.215370542409749)
(4.8510803738706825)
(5.1671739058396495)
(3.379924822092684)
(5.44620511736033)
(1.3316182291902081)
(6.039497149754528)
(1.0186258220500046)
(4.901413374586435)
(3.9720979722315213)
(3.013473887532339)
(1.945627368426971)
(4.023341548917112)
(1.4275065747144935)
(6.092441724847686)
(1.665087390141653)
(3.6326071913483524)
(1.0151921871832787)
(1.2818155993432936)
(5.886841831826809)
(5.7940791819871595)
(0.07490420737670203)
(5.028034625123011)
(0.06866876722220315)
(3.2654582439358415)
(3.038304677767711)
(3.4045952324182127)
(6.1468719429629255)
(2.9673203108213433)
(1.0954736819626447)
(1.4822851296321347)
(1.9539809980934386)
(2.8709655005455246)
(4.73687633776345)
(5.383124412867796)
(1.3142070083656607)
(4.297944350001186)
(6.082226021999324)
(5.077223029896219)
(5.852546448178683)
(4.991267000070863)
(2.6663184883716413)
(0.43771246515565343)
(1.6169222945787833)
(1.2847242337298936)
(3.8620515704471234)
(4.888386143552021)
(1.7329156155041172)
(2.0135551224558657)
(4.497806838604188)
(4.328752624958906)
(0.879810922514913)
(1.2827961258718528)
(4.753660123904345)
(2.2561916301663025)
(3.444860921021581)
(5.8918210576565535)
(0.9375344049746123)
(1.2813672161606353)
(3.6351585327429725)
(1.1575244015434982)
(0.40088127909269977)
(1.510170574778386)
(3.3793693105305853)
(3.749547218514186)
(4.220731490412051)
(2.4330980345419246)
(2.212793158296475)
(3.4401877883165124)
(0.08327554805762112)
(1.384034442784662)
(0.853561020791994)
(4.5147923302897865)
(4.022474977455316)
(0.06946110860178355)
(1.859031057509736)
(4.681036450970931)
(3.296134152002624)
(3.344197639695742)
(6.153039655487576)
(0.6631887910942482)
(4.0327777859137495)
(1.8780807098046954)
(2.8497992367858886)
(5.826354036832978)
(3.5479927304507437)
(5.287003270616315)
(3.6467098267668705)
(3.8886761673252894)
(3.598718165997979)
(5.129097478653088)
(3.8448069723750042)
(1.163700285601169)
(5.668649791712643)
(0.6499919907463552)
(1.497190794493229)
(3.3267225588931812)
(2.7391196109724376)
(0.12810755516256372)
(4.615614641841365)
(1.183770399388372)
(2.0053048617902713)
(1.73299911745249)
(3.3085444493826137)
(4.561152255077293)
(0.8211827292663378)
(5.680739655626653)
(4.375959325465994)
(3.962030163784353)
(1.5294159455989829)
(0.41236121137596304)
(1.762088792235418)
(2.9266866614692058)
(2.983207769516123)
(0.019067682265218325)
(4.72152031346068)
(5.647090579975033)
(4.589968490288668)
(1.0149905528481618)
(3.718888509087794)
(2.115980325227882)
(2.789973370530422)
(4.833016105997441)
(1.1761775128103769)
(3.9098897152586454)
(3.6312093275427673)
(5.061760045685529)
(0.8583241585842052)
(3.1626456658493143)
(4.914331705160227)
(1.2670585603966227)
(6.147032337755282)
(1.7680141399774794)
(4.810442804350889)
(0.5014743610247445)
(4.271928322767039)
(2.706806721454584)
(4.307283131540993)
(5.769151094693869)
(4.247586038770602)
(5.26839005793359)
(3.669065817095348)
(3.287089643246205)
(2.8489236381801075)
(3.047797564911792)
(6.006785635155217)
(2.8010328460257994)
(2.964897983657964)
(5.557232076797877)
(4.541268907769997)
(3.6688511997372513)
(3.576813444986715)
(1.1818697156947444)
(1.5699719748324275)
(4.021113596031248)
(0.43953605196699397)
(3.4099731133021116)
(0.763640938602952)
(4.356004911561441)
(3.892733387957538)
(4.216076984250512)
(3.069583265594295)
(3.2417492745605654)
(0.5043231276872374)
(2.456653956626199)
(1.3689173931481933)
(0.7165499329660582)
(1.6943837323126762)
(0.1358636471496754)
(5.141572776978062)
(0.1854850270264245)
(0.6660483974708145)
    );

    waveDirs
    200
    (
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
(45.0)
    );

}

"(wall1|wall2|wall3)"
{

    alpha            alpha.water;

    waveModel        shallowWaterAbsorption;

    nPaddle          10;
}
